&# cmdhelp - устарел после добавления 'BINDINGS=key:command'
&	Сообщает, какую команду вызывает нажатие клавиши
^	Показать тип соседней ловушки
^[	Отменить команду (то же, что клавиша ESCape)
&? debug
^E	Искать поблизости ловушки, секретные двери и невидимых монстров
^F	Показать карту уровня; раскрывает ловушки и секретные коридоры, но не секретные двери
^G	Создать монстра по имени или классу
^I	Показать инвентарь со всеми опознанными предметами
^O	Показать расположение особых уровней
^V	Телепортироваться между уровнями
^W	Загадать желание
&: #!debug
^E	недоступная отладочная команда
^F	недоступная отладочная команда
^G	недоступная отладочная команда
^I	недоступная отладочная команда
^O	Сокращение для '#overview': показать интересные уровни, которые вы посетили
^V	недоступная отладочная команда
^W	недоступная отладочная команда
&. #?debug
&? number_pad=0,-1
b	Идти на юго-запад на 1 клетку
B	Идти на юго-запад, пока не окажетесь на чём-нибудь
h	Идти на запад на 1 клетку
H	Идти на запад, пока не окажетесь на чём-нибудь
j	Идти на юг на 1 клетку
J	Идти на юг, пока не окажетесь на чём-нибудь
k	Идти на север на 1 клетку
K	Идти на север, пока не окажетесь на чём-нибудь
l	Идти на восток на 1 клетку
L	Идти на восток, пока не окажетесь на чём-нибудь
n	Идти на юго-восток на 1 клетку
N	Идти на юго-восток, пока не окажетесь на чём-нибудь
u	Идти на северо-восток на 1 клетку
U	Идти на северо-восток, пока не окажетесь на чём-нибудь
&# y,Y обрабатываются ниже
&: #number_pad=1,2,3,4
h	Помощь: синоним '?'
j	Прыжок: сокращение для '#jump'
k	Пинок: синоним '^D'
l	Обыск: сокращение для '#loot'
n	Начать отсчёт; продолжить цифрой(ами)
N	Имя: сокращение для '#name'
u	Обезвреживание: сокращение для '#untrap'
&. #0,-1 vs 1,2,3,4
a	Применить (использовать) инструмент или сломать волшебную палочку
A	Снять всю броню и/или все аксессуары и/или убрать оружие
^A	Повторить предыдущую команду
^B	Идти на юго-запад, пока не окажетесь рядом с чём-нибудь
c	Закрыть дверь
C	Назвать (по имени) монстра, отдельный предмет или тип предметов
^C	Прервать: выйти из игры
d	Бросить предмет
D	Бросить предметы определённых типов
^D	Пнуть что-нибудь (обычно дверь, сундук или ящик)
e	Съесть что-нибудь
E	Сделать надпись на полу
f	Стрелять боеприпасами из колчана
F	Вслед за направлением — сражаться с монстром (даже если вы его не чувствуете)
g	Вслед за направлением — идти, пока не увидите что-нибудь интересное
G	Вслед за направлением — то же, что управляющее направление
^H	Идти на запад, пока не окажетесь рядом с чём-нибудь
i	Показать ваш инвентарь
I	Инвентарь предметов конкретных типов
^J	Идти на юг, пока не окажетесь рядом с чём-нибудь
^K	Идти на север, пока не окажетесь рядом с чём-нибудь
^L	Идти на восток, пока не окажетесь рядом с чём-нибудь
m	Вслед за направлением — идти, не подбирая ничего и не сражаясь
M	Вслед за направлением — пройти расстояние, не подбирая ничего
^N	Идти на юго-восток, пока не окажетесь рядом с чём-нибудь
o	Открыть дверь
O	Показать настройки, возможно, изменить их
p	Оплатить счёт за покупки
P	Надеть аксессуар (кольцо, амулет и т.п.; работает и для брони)
^P	Листать ранее показанные сообщения игры
q	Выпить (отпить) что-нибудь (зелье, воду и т.п.)
Q	Выбрать боеприпасы для колчана (для выхода используйте '#quit')
r	Прочесть свиток или книгу заклинаний
R	Снять аксессуар (кольцо, амулет и т.п.; работает и для брони)
^R	Перерисовать экран
s	Обыскать все непосредственно соседние клетки на ловушки и секретные двери
S	Сохранить игру (и выйти; «сохранить и продолжить» отсутствует)
t	Метнуть что-нибудь (выберите предмет, затем направление — а не цель)
T	Снять одну часть брони (работает и для аксессуаров)
^T	Телепортироваться по уровню
^U	Идти на северо-восток, пока не окажетесь рядом с чём-нибудь
v	Показать версию ('#version' показывает больше сведений)
V	Показать историю разработки игры
w	Взять в руки оружие (для двух оружий: 'w' вторичное, 'x', 'w' основное, 'X')
W	Надеть часть брони (работает и для аксессуаров)
x	Поменять местами оружие в руках и вторичное
X	Переключить бой двумя оружиями
^X	Показать ваши характеристики (в режиме отладки или исследования показывает больше)
&? number_pad=0,1,2,3,4
&? number_pad=0
y	Идти на северо-запад на 1 клетку
Y	Идти на северо-запад, пока не окажетесь на чём-нибудь
&.
^Y	Идти на северо-запад, пока не окажетесь рядом с чём-нибудь
z	Взмахнуть волшебной палочкой
Z	Взмахнуть (сотворить) заклинание
&? suspend
^Z	Приостановить игру; для возобновления — 'fg' (передний план)
&:
^Z	недоступная команда: приостановка
&.
&: number_pad=-1
y	Взмахнуть волшебной палочкой
Y	Взмахнуть (сотворить) заклинание
&? suspend
^Y	Приостановить игру; для возобновления — 'fg' (передний план)
&:
^Y	недоступная команда: приостановка
&.
z	Идти на северо-запад на 1 клетку
Z	Идти на северо-запад, пока не окажетесь на чём-нибудь
^Z	Идти на северо-запад, пока не окажетесь рядом с чём-нибудь
&. #0,1..4 vs -1
<	Подняться по лестнице
>	Спуститься по лестнице
/	Показать, какому типу вещей соответствует символ
?	Выдать справочное сообщение
&? shell
!	Совершить побег в оболочку; для возврата — 'exit'
&:
!	недоступная команда: оболочка
&.
\	Показать, какие типы предметов были открыты
`	Показать открытые типы для одного класса предметов
_	Путешествие по кратчайшему пути к точке на карте
.	Отдохнуть один ход, ничего не делая
&? rest_on_space
 	Отдохнуть один ход, ничего не делая
&.
:	Осмотреться, что на полу
;	Показать, какому типу вещей соответствует символ карты на уровне
,	Подобрать предметы в текущей позиции
@	Переключить опцию подбора предметов вкл/выкл
)	Показать оружие, которое сейчас в руках или наготове
[	Показать надетую броню
=	Показать надетые кольца
"	Показать надетый амулет
(	Показать используемые инструменты
*	Показать всё используемое снаряжение (комбинация команд ),[,=,",()
$	Пересчитать ваше золото
+	Показать известные заклинания
Del	Показать карту без монстров и предметов, загораживающих обзор
#	Выполнить расширенную команду (для списка вариантов используйте '#?')
&# number_pad:
&#  -1 = цифровая клавиатура выключена, поменять местами y и z (включая Y и Z, ^Y и ^Z, M-y и т.д.)
&#   0 = цифровая клавиатура выключена (по умолчанию)
&#   1 = цифровая клавиатура включена, обычная раскладка, '5'->'g'
&#   2 = цифровая клавиатура включена, обычная раскладка, '5'->'G'
&#   3 = цифровая клавиатура включена, телефонная раскладка, '5'->'g'
&#   4 = цифровая клавиатура включена, телефонная раскладка, '5'->'G'
&? number_pad = 1,2,3,4
0	Показать инвентарь
4	Идти на запад
6	Идти на восток
-	Префикс 'F'; принудительный бой
&: #-1,0
0	Продолжить отсчёт
4	Начать или продолжить отсчёт
6	Начать или продолжить отсчёт
&. #1,2,3,4 vs -1,0
&? number_pad=1,2
7	Идти на северо-запад
8	Идти на север
9	Идти на северо-восток
1	Идти на юго-запад
2	Идти на юг
3	Идти на юго-восток
&: number_pad=3,4
1	Идти на северо-запад
2	Идти на север
3	Идти на северо-восток
7	Идти на юго-запад
8	Идти на юг
9	Идти на юго-восток
&: #-1,0
1	Начать или продолжить отсчёт
2	Начать или продолжить отсчёт
3	Начать или продолжить отсчёт
7	Начать или продолжить отсчёт
8	Начать или продолжить отсчёт
9	Начать или продолжить отсчёт
&. #1,2 vs 3,4 vs -1,0
&? number_pad=1,3
5	Префикс движения 'g'
M-5	Префикс движения 'G'
&: number_pad=2,4
5	Префикс движения 'G'
M-5	Префикс движения 'g'
M-0	Инвентарь предметов конкретных типов
&: #-1,0
5	Начать или продолжить отсчёт
M-2	Переключить бой двумя оружиями
&. #1,3 vs 2,4 vs -1,0
M-?	Показать справку по расширенным командам (если платформа это позволяет)
M-a	Изменить буквы инвентаря
M-A	Аннотация: ввести название для текущего уровня подземелья
M-c	Беседа: поговорить с соседним существом
M-C	Поведение: список добровольных ограничений, которых вы придерживаетесь
M-d	Окунуть предмет во что-нибудь
M-e	Улучшение: проверить навыки владения оружием, повысить их, если возможно
M-f	Взломать замок
M-i	Воззвать к особым силам предмета
M-j	Прыгнуть на соседнюю клетку
M-l	Обыскать коробку на полу
M-m	Будучи полиморфным, использовать особую способность монстра
M-n	Назвать монстра, отдельный предмет или тип предметов
M-N	Назвать монстра, отдельный предмет или тип предметов
M-o	Принести жертву богам
M-O	Обзор: показать сводку исследованного подземелья
M-p	Помолиться богам о помощи
M-q	Выйти (выйти без сохранения)
M-r	Потереть лампу или оселок
M-R	Верхом: сесть на седланного скакуна или слезть с него
M-s	Сесть
M-t	Обратить нежить
M-T	Вытряхнуть: опорожнить контейнер
M-u	Обезвредить что-нибудь (ловушку, дверь или сундук)
M-v	Вывести опции времени компиляции для этой версии NetHack
M-w	Вытереть лицо
M-X	Переключиться с обычной игры на режим исследования
