        Добро пожаловать в NetHack!                ( описание версии 3.6 )

        NetHack — игра в стиле Dungeons and Dragons, где вы (искатель
        приключений) спускаетесь в глубины подземелья в поисках Амулета
        Йендора, который, как считается, спрятан где-то ниже двадцатого
        уровня.  Вы начинаете приключение с питомцем, который может помочь
        вам многими способами и которого можно обучить разным вещам.  В пути
        вы найдёте полезные (или бесполезные) предметы, вполне возможно, с
        магическими свойствами, а также разнообразных монстров.  Вы можете
        атаковать монстра, попытавшись шагнуть на клетку, где находится
        монстр (но часто гораздо мудрее оставить его в покое).

        В отличие от большинства приключенческих игр, которые дают
        словесное описание вашего местоположения, NetHack даёт вам зрительный
        образ текущего уровня подземелья, на котором вы находитесь.

        NetHack использует следующие символы:

        - и |  Стены комнаты, возможно также открытые двери или могила.
        .        Пол комнаты или дверной проём.
        #        Коридор, железные прутья, дерево, либо, возможно,
                 кухонная раковина (если в вашем подземелье есть раковины)
                 или подъёмный мост.
        >        Лестница вниз: путь на следующий уровень.
        <        Лестница вверх: путь на предыдущий уровень.
        @        Вы (обычно) или другой человек.
        )        Оружие какого-либо рода.
        [        Доспех или часть брони.
        %        Что-то съедобное (не обязательно полезное).
        /        Волшебная палочка.
        =        Кольцо.
        ?        Свиток.
        !        Зелье.
        (        Какой-то другой полезный предмет (кирка, ключ, лампа...)
        $        Куча золота.
        *        Самоцвет или камень (возможно, ценный, возможно, никчемный).
        +        Закрытая дверь или книга заклинаний с заклинанием,
                 которое вы можете выучить.
        ^        Ловушка (после того как вы её обнаружите).
        "        Амулет или паутина.
        0        Железное ядро.
        _        Алтарь или железная цепь.
        {        Фонтан.
        }        Водоём, ров или бассейн лавы.
        \        Роскошный трон.
        `        Валун или статуя.
        A-Z, a-z и некоторые другие:  Монстры.
        I        Последнее известное местонахождение невидимого или
                 незримого монстра

                 Вы можете узнать, что означает символ, набрав '/'
                 и следуя указаниям, чтобы переместить курсор на нужный
                 символ.  Например, 'd' может оказаться собакой.


y k u   7 8 9   Команды движения:
 \|/     \|/            yuhjklbn: сделать один шаг в указанном направлении
h-.-l   4-.-6           YUHJKLBN: идти в указанном направлении, пока не
 /|\     /|\                        упрётесь в стену или не столкнётесь
b j n   1 2 3           g<направление>: бежать в направлении <направление>,
      numberpad                     пока не увидите что-нибудь интересное
                         G<направление>: то же, но ответвление коридора не
  <  вверх               ^<направление>: считается интересным (^ здесь
                                     означает клавишу Control, а не крышку)
  >  вниз                m<направление>: идти, не подбирая предметы
                         F<направление>: сражаться, даже если вы не
                                           чувствуете монстра
                Если задана опция number_pad, вместо них двигают цифровые
                клавиши.  В зависимости от платформы Shift+цифра (на
                цифровой клавиатуре), Meta+цифра или Alt+цифра вызывают
                команды YUHJKLBN.  Control <направление> может работать или
                не работать при включённом number_pad, в зависимости от
                возможностей платформы.
                Цифра '5' действует как префикс 'G', если только number_pad
                не установлен в 2, в этом случае она действует как 'g'.
                Если number_pad равен 3, роли клавиш 1,2,3 и 7,8,9
                меняются местами; если он равен 4, поведение такое же, как
                3 в сочетании с 2.
                Если number_pad равен -1, используются буквенные команды
                движения, но 'y' и 'z' меняются местами.

Команды:
        NetHack знает следующие команды:
        ?       Меню помощи.
        /       Что это: сообщить, что представляет собой символ.  Можно
                указать позицию или задать символ в качестве аргумента.
                Включение опции autodescribe будет выдавать сведения о
                символе в каждой позиции, на которую вы наводите курсор.
        &       Сообщить, что делает команда.
        <       Подняться по лестнице (если вы стоите на ней).
        >       Спуститься по лестнице (если вы стоите на ней).
        .       Отдохнуть, ничего не делать один ход.
        _       Путешествие по кратчайшему пути к точке на карте.
        a       Применить (использовать) инструмент (кирку, ключ, лампу...).
        A       Снять всю броню.
        ^A      Повторить предыдущую команду.
        c       Закрыть дверь.
        C       Назвать (по имени) монстра, отдельный предмет или тип
                предметов.
        d       Бросить что-нибудь.  d7a: бросить семь предметов объекта a.
        D       Бросить несколько предметов.  Эта команда реализована двумя
                способами.  Первый способ:
                "D" показывает список всех ваших предметов, из которого вы
                можете выбрать, что бросить.  "+" рядом с предметом
                означает, что он будет брошен, "-" — что нет.  Переключить
                выбор предмета можно, набрав букву рядом с его описанием.
                Выбрать все предметы — "+", снять выбор со всех — "=".
                <SPACEBAR> переводит вас со страницы списка на следующую.
                Второй способ:
                "D" задаст вопрос «Какие предметы вы хотите бросить?
                [!%= au]».  Следует ввести ноль или более символов
                предметов, возможно, с последующими 'a' и/или 'u'.
                Da — бросить все предметы без запроса подтверждения.
                Du — бросить только неоплаченные предметы (в магазине).
                D%u — бросить только неоплаченную еду.
        ^D      Пинок (обычно для дверей).
        e       Съесть еду.
        E       Сделать надпись на полу.
                E- — писать пальцами по пыли.
        f       Стрелять боеприпасами из колчана.
        F       Вслед за направлением — сражаться с монстром (даже если вы
                его не чувствуете).
        i       Показать ваш инвентарь.
        I       Показать выбранные части вашего инвентаря, например:
                I* — показать все самоцветы в инвентаре.
                Iu — показать все неоплаченные предметы.
                Ix — показать все использованные предметы из вашего счёта.
                I$ — пересчитать ваши деньги.
        o       Открыть дверь.
        O       Просмотреть текущие настройки и, возможно, изменить их.
                Будет показано меню с настройками, и большинство из них
                можно изменить, просто выбрав соответствующую запись.
                Обычно настройки задаются до игры через переменную среды
                NETHACKOPTIONS или через файл конфигурации (defaults.nh,
                NetHack Defaults, nethack.cnf, ~/.nethackrc и т.д.), а не
                командой 'O'.
        p       Оплатить счёт за покупки.
        P       Надеть аксессуар (кольцо, амулет и т.п.).
        ^P      Повторить последнее сообщение (повторные ^P повторяют
                более ранние сообщения).  Поведение можно менять опцией
                msg_window.
        q       Выпить (отпить) что-нибудь (зелье, воду и т.п.).
        Q       Выбрать боеприпасы для колчана.
        #quit   Выйти из программы без сохранения текущей игры.
        r       Прочесть свиток или книгу заклинаний.
        R       Снять аксессуар (кольцо, амулет и т.п.).
        ^R      Перерисовать экран.
        s       Искать вокруг секретные двери и ловушки.
        S       Сохранить игру.  Также выход из программы.
                [Чтобы восстановить, просто сыграйте снова, используя то же
                имя персонажа.]
                [Возможности «сохранить текущие данные, но продолжать играть»
                не существует.]
        t       Метнуть предмет или выпустить снаряд.
        T       Снять броню.
        ^T      Телепортироваться, если у вас есть такая возможность.
        v       Показать номер версии.
        V       Показать более подробную идентификацию версии, включая
                историю игры.
        w       Взять оружие в руки.  w- означает не брать ничего,
                использовать голые руки.
        W       Надеть броню.
        x       Поменять местами оружие в руках и вторичное.
        X       Переключить бой двумя оружиями.
        ^X      Показать ваши характеристики.
        #explore  Переключиться в режим исследования (также известный как
                режим открытий), где смерть и удаление файла сохранения при
                восстановлении могут быть отменены.
        z       Взмахнуть волшебной палочкой.  (Если number_pad равен -1,
                используйте y вместо z.)
        Z       Сотворить заклинание.  (Если number_pad равен -1,
                используйте Y вместо Z.)
        ^Z      Приостановить игру.  (Если number_pad равен -1, ^Y вместо
                ^Z.)  [Для возобновления используйте команду оболочки 'fg'.]
        :       Осмотреться, что здесь есть.
        ;       Осмотреться, что есть где-то ещё.
        ,       Подобрать некоторые предметы.
        @       Переключить опцию подбора предметов.
        ^       Спросить тип ловушки, найденной ранее.
        )       Сообщить, каким оружием вы размахиваете.
        [       Сообщить, какую броню вы носите.
        =       Сообщить, какие кольца вы носите.
        "       Сообщить, какой амулет вы носите.
        (       Сообщить, какие инструменты вы используете.
        *       Сообщить, какое снаряжение вы используете; объединяет
                предыдущие пять.
        $       Пересчитать ваши золотые монеты.
        +       Показать заклинания, которые вы знаете; также можно
                переставить их при желании.
        \       Показать, какие типы предметов были открыты.
        `       Показать открытые типы для одного класса предметов.
        !       Побег в оболочку, если это поддерживается вашей версией и
                операционной системой.  [Чтобы возобновить игру, завершите
                подпроцесс оболочки через 'exit'.]
        #       Начинает одну из «расширенных» команд.  Чтобы получить
                список команд, которые можно использовать с "#", наберите
                "#?".  Доступные расширенные команды зависят от того, с
                какими опциями была скомпилирована игра, а также от вашего
                класса и типа монстра, на которого вы в данный момент более
                всего похожи.  Если на вашей клавиатуре есть мета-клавиша
                (которая при нажатии вместе с другой клавишей изменяет её,
                устанавливая бит 'meta' (8-й, или 'старший')), эти
                расширенные команды можно вызывать, нажимая meta вместе с
                первой буквой команды.  Клавиша Alt может иметь похожий
                эффект.

        Если опция "number_pad" включена, доступны некоторые
        дополнительные буквенные команды:

        h       показывает меню помощи, как '?'
        j       Прыжок в другое место.
        k       Пинок (обычно для дверей).
        l       Обыскать коробку на полу.
        n       число, после которого следует количество повторов следующей
                команды.
        N       Назвать монстра, отдельный предмет или тип предметов.
        u       Обезвредить ловушку или дверь.

        Можно поставить число перед командой, чтобы повторить её столько
        раз, например "40." или "20s".  Если задана опция number_pad,
        следует набирать 'n' для префикса отсчёта, например "n40." или
        "n20s".


        Некоторая информация отображается в нижней строке или, возможно,
        в рамке, в зависимости от используемой платформы.  Вы видите свои
        характеристики, мировоззрение, на каком уровне подземелья вы
        находитесь, сколько у вас сейчас очков здоровья (и сколько будет
        при полном восстановлении), каков ваш класс брони (чем ниже, тем
        лучше), ваш уровень опыта и состояние вашего желудка.  По желанию
        вы можете видеть или не видеть другую информацию, такую как очки
        заклинаний, сколько у вас золота и т.п.

        Удачи вам и приятного взлома!
