y k u   7 8 9   Команды движения:
 \|/     \|/            yuhjklbn: сделать один шаг в указанном направлении
h-.-l   4-.-6           YUHJKLBN: идти в указанном направлении, пока не
 /|\     /|\                        упрётесь в стену или не столкнётесь
b j n   1 2 3           g<направление>: бежать в направлении <направление>,
      numberpad                     пока не увидите что-нибудь интересное
                         G<направление>: то же, но ответвление коридора не
  <  вверх               ^<направление>: считается интересным (^ здесь
                                     означает клавишу Control, а не крышку)
  >  вниз                m<направление>: идти, не подбирая предметы и не
                                           сражаясь
                         F<направление>: сражаться, даже если вы не
                                           чувствуете монстра
                Если задана опция number_pad, вместо них двигают цифровые
                клавиши.  В зависимости от платформы Shift+цифра (на
                цифровой клавиатуре), Meta+цифра или Alt+цифра вызывают
                команды YUHJKLBN.  Control <направление> может работать или
                не работать при включённом number_pad, в зависимости от
                возможностей платформы.
                Цифра '5' действует как префикс 'G', если только number_pad
                не установлен в 2, в этом случае она действует как 'g'.
                Если number_pad равен 3, роли клавиш 1,2,3 и 7,8,9
                меняются местами; если он равен 4, поведение такое же, как
                3 в сочетании с 2.
                Если number_pad равен -1, используются буквенные команды
                движения, но 'y' и 'z' меняются местами.

Общие команды:
?     help      показать один из нескольких справочных текстов
#quit quit      завершить игру без сохранения текущей игры
S     save      сохранить игру (для продолжения позже) и выйти
                [чтобы восстановить, сыграйте снова, используя то же имя
                персонажа; для выхода без сохранения используйте #quit]
!     sh        побег в какую-нибудь оболочку (если разрешено; 'exit' —
                чтобы возобновить игру)
^Z    suspend   приостановить игру (независимо от вашего текущего символа
                приостановки)
                [в системах на основе UNIX(tm) для возобновления используйте
                команду 'fg']
O     options   задать настройки
/     what-is   сообщить, что представляет собой символ карты
\     known     показать список того, что было открыто
|     perminv   взаимодействовать с постоянным окном инвентаря вместо
                героя и карты
v     chronicle показать список важных событий
V     version   показать номер версии
^A    again     повторить предыдущую команду
^R    redraw    перерисовать экран
^P    prevmsg   повторить предыдущее сообщение (подряд идущие ^P повторяют
                более ранние)
#               начинает расширенную команду (#? — для их списка)
&     what-does описать команду, которую вызывает нажатие клавиши

Управляющие символы обозначаются как '^', за которым следует буква.
Нажмите Ctrl или Control, как клавишу shift, затем наберите букву.
Управляющие символы не зависят от регистра; ^D это то же, что ^d,
Ctrl+d это то же, что Ctrl+Shift+d.  Есть несколько управляющих символов,
не являющихся буквами; nethack использует ^[ как синоним Escape (или
наоборот) и ^_ для #retravel, но больше никаких.

Игровые команды:
^D    kick      пнуть (дверь или что-то другое)
^T    Tport     телепортироваться (если можете)
^X    show      показать ваши характеристики
a     apply     применить или использовать инструмент (кирку, ключ,
                фотоаппарат и т.п.)
A     takeoffall  выбрать несколько предметов брони, аксессуаров и оружия
                для снятия, удаления или откладывания (занимает столько же
                игрового времени, сколько снятие каждого из них по
                отдельности командами T,R,w-)
c     close     закрыть дверь
C     call      назвать монстра, отдельный предмет или тип предметов
d     drop      бросить предмет.  d7a: бросить семь предметов объекта 'a'
D     Drop      бросить выбранные типы предметов
e     eat       съесть что-нибудь
E     engrave   написать сообщение пальцами в пыли на полу  (E- —
                использовать пальцы)
f     fire      стрелять боеприпасами из колчана
F     fight     в зависимости от направления — сражаться с монстром
i     invent    показать ваш инвентарь (все предметы, которые вы несёте)
I     Invent    показать выбранные части вашего инвентаря; например
                  I(  показать все инструменты, или  I"  показать все
                       амулеты
                  IB  показать все предметы, о которых известно, что они
                       благословлены
                  IU  несблагословлены, или  IC  прокляты, или  IX
                       неизвестное состояние благословения
                  Iu  в магазине — показать неоплаченные предметы, которые
                       вы несёте
                  Ix  в магазине — показать любые сборы и использованные
                       предметы магазина
o     open      открыть дверь
p     pay       оплатить ваш счёт (в магазине)
P     puton     надеть аксессуар (кольцо, амулет и т.п.; можно также
                надеть броню, но предметы брони не указаны как вероятные
                кандидаты)
q     quaff     выпить что-нибудь (зелье, воду и т.п.)
Q     quiver    выбрать боеприпасы для колчана (для выхода используйте
                '#quit')
r     read      прочесть свиток или книгу заклинаний
R     remove    снять аксессуар (кольцо, амулет и т.п.; можно также снять
                броню)
s     search    искать секретные двери, скрытые ловушки и монстров
t     throw     метнуть или выпустить оружие
T     takeoff   снять часть брони; можно также снять аксессуары, но они
                не указаны как вероятные кандидаты
w     wield     взять оружие в руки  (w- — не брать ничего, чтобы убрать
                текущее оружие)
W     wear      надеть предмет брони; можно также надеть аксессуары, но
                они не указаны как вероятные кандидаты
x     xchange   поменять местами оружие в руках и вторичное
X     twoweapon переключить бой двумя оружиями, если роль позволяет
z     zap       взмахнуть волшебной палочкой  (если number_pad равен -1,
                используйте y вместо z)
Z     Zap       сотворить заклинание  (если number_pad равен -1,
                используйте Y вместо Z)
<     up        подняться по лестнице
>     down      спуститься по лестнице
^     trap_id   опознать ранее найденную ловушку
),[,=,",(       показать текущие используемые предметы указанного символа
*               показать комбинацию ),[,=,",( сразу
$     gold      пересчитать ваше золото
+     spells    показать заклинания, которые вы знаете; также можно
                переставить их при желании
`     classkn   показать известные предметы для одного класса предметов
_     travel    двигаться по кратчайшему пути к точке на карте
^_    retravel  возобновить движение к ранее указанному месту назначения
.     rest      подождать момент
,     pickup    подобрать всё, что можете унести
@               переключить опцию «pickup» (автоподбор) вкл/выкл
:     look      посмотреть, что здесь есть
;     farlook   посмотреть, что есть где-то ещё, выбрав позицию на карте
                (для монстра поверх одного или нескольких предметов
                описывается только монстр; для кучи предметов — только
                верхний)

Клавиатуры с мета-клавишей (некоторые используют для этого Alt, так что
нажатие Alt как shift вместе с 'e' даст 'M-e') позволяют также использовать
эти расширенные команды через модификатор meta как альтернативу префиксу
#.  В отличие от управляющих символов, мета-символы чувствительны к
регистру, поэтому M-a отличается от M-A.  Наберите последний, используя
две клавиши как shift: Meta+Shift+a.

M-?             показать справку по расширенным командам (если платформа
                это позволяет)
M-2   twoweapon переключить бой двумя оружиями (если number_pad не включён)
M-a   adjust    изменить буквы инвентаря
M-A   annotate  добавить однострочное примечание к текущему уровню
                подземелья (см. M-O)
M-c   chat      поговорить с кем-нибудь
M-C   conduct   показать добровольные ограничения
M-d   dip       окунуть предмет во что-нибудь
M-e   enhance   показать навыки владения оружием и заклинаниями; можно
                улучшить их, если это допустимо
M-f   force     взломать замок
M-g   genocided показать типы истреблённых и вымерших монстров, если такие
                есть
M-i   invoke    воззвать к особым силам предмета
M-j   jump      прыгнуть в другое место
M-l   loot      обыскать коробку на полу
M-m   monster   будучи полиморфным, использовать особую способность монстра
M-n   name      назвать монстра, отдельный предмет или тип предметов
M-N   name      синоним M-n  (оба то же, что C)
M-o   offer     принести жертву богам
M-O   overview  показать сведения о посещённых уровнях и примечаниях
M-p   pray      помолиться богам о помощи
M-q   quit      прекратить игру без сохранения (используйте S, чтобы
                сохранить и выйти)
M-r   rub       потереть лампу или камень
M-R   ride      сесть на седланного скакуна или слезть с него
M-s   sit       сесть
M-t   turn      обратить нежить, если роль позволяет
M-T   tip       опорожнить контейнер, вытряхнув его содержимое
M-u   untrap    обезвредить что-нибудь
M-V   vanquished показать количество и типы поверженных монстров
M-v   version   показать опции времени компиляции для этой версии
M-w   wipe      вытереть лицо
M-X   explore   переключиться с обычной игры на нерейтинговый режим
                исследования

Если включена опция 'number_pad', клавиши, обычно используемые для
движения, можно использовать для различных команд:

n               число, после которого следует количество повторов следующей
                команды
h     help      показать один из нескольких справочных текстов, как '?'
j     jump      прыгнуть в другое место
k     kick      пнуть что-нибудь (обычно дверь)
l     loot      обыскать коробку на полу
N     name      назвать предмет или тип предметов
u     untrap    обезвредить что-нибудь (обычно объект с ловушкой)

Дополнительные команды доступны в режиме отладки (также известном как
режим волшебника).
