Файл истории NetHack для выпуска 5.0

Внемли, смертный, истокам NetHack...

Джей Фенласон написал оригинальный Hack с помощью Кенни Вудланда,
Майка Тома и Джона Пейна.

Андрис Брауэр выполнил крупную переработку, работая в Stichting
Mathematisch Centrum (ныне Centrum Wiskunde & Informatica), превратив
Hack в совсем другую игру.  Он опубликовал исходный код Hack для
использования в системах UNIX(tm), разместив его в новостной группе Usenet
net.sources (позже переименованной в comp.sources), выпустив версию 1.0
в декабре 1984 года, затем версии 1.0.1, 1.0.2 и, наконец, 1.0.3 в июле
1985 года.  Новостная группа Usenet net.games.hack (позже переименованная
в rec.games.hack и в итоге заменённая на rec.games.roguelike.nethack) была
создана для её обсуждения.

Дон Г. Неллер перенёс Hack 1.0.3 на Microsoft(tm) C и MS-DOS(tm),
создав PC HACK 1.01e, добавил поддержку графики DEC Rainbow в версии
1.03g и выпустил по меньшей мере ещё четыре версии (3.0, 3.2, 3.51
и 3.6; обратите внимание, что это старые номера версий Hack, а не
современные номера NetHack).

Р. Блэк перенёс PC HACK 3.51 на Lattice(tm) C и Atari 520/1040ST,
создав ST Hack 1.03.

Майк Стивенсон объединил эти различные версии обратно, включив многие
из добавленных возможностей, и выпустил NetHack версии 1.4 в 1987 году.
Затем он координировал огромный коллектив по улучшению и отладке NetHack
1.4 и выпустил версии NetHack 2.2 и 2.3.  Как и Hack, они были выпущены
путём публикации исходного кода в Usenet, где оставались доступными в
различных архивах через ftp и uucp после истечения срока нахождения в
новостной группе.

Позже Майк координировал крупную переработку игры, возглавив команду,
в которую входили Кен Арромди, Жан-Кристоф Колле, Стив Крепс, Эрик
Хендриксон, Изчак Миллер, Эрик С. Рэймонд, Джон Рупли, Майк Трипоинт
и Джанет Валз, для создания NetHack 3.0c.

NetHack 3.0 был перенесён на Atari Эриком Р. Смитом, на OS/2 — Тимо
Хакулиненом, а на VMS — Дэвидом Гентцелом.  Все трое вместе с Кевином
Дарси позже присоединились к основной команде разработчиков NetHack для
создания последующих редакций 3.0.

Олаф Зайберт перенёс NetHack 2.3 и 3.0 на Amiga.  Норм Мелух, Стивен
Спакман и Пьер Мартино разработали оверлейный код для PC NetHack 3.0.
Джонни Ли перенёс NetHack 3.0 на Macintosh.  Вместе с другими
искателями приключений они продолжали улучшать порты для PC, Macintosh
и Amiga в течение более поздних редакций 3.0.

Версия 3.0 прошла через десять сравнительно быстро выпущенных редакций
«уровня исправлений».  Версии в то время назывались 3.0 для базового
выпуска и по-разному как «3.0a» — «3.0j», «3.0 patchlevel 1» —
«3.0 patchlevel 10» или «3.0pl1» — «3.0pl10», а не 3.0.0 и 3.0.1 —
3.0.10; трёхкомпонентная схема нумерации начала использоваться с 3.1.0.

Возглавляемая Майком Стивенсоном и координируемая Изчаком Миллером и
Джанет Валз, команда разработчиков NetHack, в которую теперь входили
Кен Арромди, Дэвид Корс, Жан-Кристоф Колле, Кевин Дарси, Мэтт Дэй, Тимо
Хакулинен, Стив Линхарт, Дин Люик, Пэт Рэнкин, Эрик Рэймонд и Эрик Смит,
предприняла радикальную пересмотр 3.0.  Они перестроили дизайн игры и
переписали основные части кода.  Они добавили множество подземелий,
новое отображение, особые индивидуальные квесты персонажей, новую
концовку и много других новых возможностей и создали NetHack 3.1.
Версия 3.1.0 была выпущена в январе 1993 года.

Кен Лорбер, Грегг Вондерли и Грег Олсон с помощью Ричарда Эддисона,
Майка Пассаретти и Олафа Зайберта разработали NetHack 3.1 для Amiga.

Норм Мелух и Кевин Смолковски с помощью Карла Шелина, Стивена Спакмана,
Стива ВанДевендера и Пола Виннера перенесли NetHack 3.1 на PC.

Джон Вютте и Хао-ян Ван с помощью Росса Брауна, Майка Энгбера, Дэвида
Хэрстона, Майкла Хамела, Джонатана Хэндлера, Джонни Ли, Тима Леннана,
Роба Менке и Энди Суонсона разработали NetHack 3.1 для Macintosh, перенеся
его для MPW.  Основываясь на их разработке, Барт Хаус добавил порт Think C.

Тимо Хакулинен перенёс NetHack 3.1 на OS/2.  Эрик Смит перенёс NetHack
3.1 на Atari.  Пэт Рэнкин с помощью Джошуа Делаханти отвечал за версию
VMS NetHack 3.1.  Майкл Эллисон перенёс NetHack 3.1 на Windows NT.

Дин Люик с помощью Дэвида Корса разработал NetHack 3.1 для X11.
Он рисовал карту текстом, а не графически, но включал nh10.bdf —
необязательно используемый особый шрифт X11 с крошечными изображениями
вместо букв и знаков препинания, предшественник тайлов.  Эти изображения
не распространяются на отдельные типы монстров и предметов, а лишь
заменяют классы монстров и предметов (так что одно изображение для всех
насекомых «a» и другое для всей брони «[» и так далее, а не отдельные
изображения для жуков и муравьёв или для плащей и сапог).

Уорик Эллисон написал графически отображаемую версию NetHack для Atari,
где крошечные картинки назывались «иконками» и были различными для
конкретных типов монстров и предметов, а не только их классов.  Он
передал их команде разработчиков NetHack, которая переименовала их в
«тайлы» — первоначальное употребление, которое впоследствии было
подхвачено другими играми.  Затем поддержка тайлов NetHack была
реализована на других платформах (изначально MS-DOS, а со временем также
Windows, Qt и X11).

Команда разработчиков NetHack 3.2 в составе Майкла Эллисона, Кена
Арромди, Дэвида Корса, Джесси Колле, Стива Крепса, Кевина Дарси, Тимо
Хакулинена, Стива Линхарта, Дина Люика, Пэта Рэнкина, Эрика Смита,
Майка Стивенсона, Джанет Валз и Пола Виннера выпустила версию 3.2.0
в апреле 1996 года.

Версия 3.2 ознаменовала десятую годовщину формирования команды
разработчиков.  В знак их преданности игре все тринадцать участников
первоначальной команды разработчиков NetHack остались в команде на начало
работы над этим выпуском.  В период между выпуском 3.1.3 и 3.2.0 один из
основателей команды разработчиков NetHack, д-р Изчак Миллер, был
диагностирован рак, и он скончался.  Этот выпуск игры был посвящён ему
командами разработчиков и портирования.

Версия 3.2 оказалась более стабильной, чем предыдущие.  Было исправлено
много ошибок, устранены злоупотребления, а игровые возможности
настроены для лучшего игрового процесса.

За время существования NetHack 3.1 и 3.2 несколько энтузиастов игры
добавили свои собственные модификации в игру и сделали эти «варианты»
публично доступными:

Том Проудфут и Юваль Орен создали NetHack++, который быстро был
переименован в NetHack--, когда некоторые ошибочно предположили, что это
преобразование исходного кода C в C++.  Работая независимо, Стивен Уайт
написал NetHack Plus.  Том Проудфут позже объединил NetHack Plus и свой
собственный NetHack-- и создал SLASH.  Ларри Стюарт-Зерба и Уорик
Эллисон улучшили систему сотворения заклинаний с помощью Wizard Patch.
Уорик Эллисон также перенёс NetHack на использование интерфейса Qt.

Уоррен Чунг объединил SLASH с Wizard Patch, создав Slash'EM, и с помощью
Кевина Хьюго добавил больше возможностей.  Кевин позже присоединился к
команде разработчиков NetHack и включил лучшее из этих идей в NetHack
3.3.

Финальным обновлением 3.2 стал выпуск исправлений ошибок 3.2.3, который
вышел одновременно с 3.3.0 в декабре 1999 года, как раз к году 2000.
Из-за более новой версии 3.2.3 была выпущена только как патч исходного
кода, без готовых к запуску дистрибутивов для систем, у которых они
обычно были.

(Для тех, кто рассматривает возрождение старой версии: все версии до
3.2.3 имели ошибку Y2K.  Файл лучших результатов и файл журнала содержали
даты, форматированные с двузначным годом, и за 1999 годом, годом 99,
следовал 2000 год, год 100.  Это успешно записывалось, но непреднамеренно
вводило дополнительный столбец в структуру файла, что мешало корректному
считыванию записей очков, препятствуя вставке новых высоких результатов и
получению старых имён персонажей для случайных имён призраков и статуй в
текущей игре.)

Команда разработчиков NetHack 3.3 в составе Майкла Эллисона, Кена
Арромди, Дэвида Корса, Джесси Колле, Стива Крепса, Кевина Дарси, Тимо
Хакулинена, Кевина Хьюго, Стива Линхарта, Кена Лорбера, Дина Люика,
Пэта Рэнкина, Эрика Смита, Майка Стивенсона, Джанет Валз и Пола Виннера
выпустила 3.3.0 в декабре 1999 года и 3.3.1 в августе 2000 года.

Версия 3.3 предложила много новшеств.  Это была первая версия,
разделившая расу и профессию.  Класс эльфа был удалён в пользу расы
эльфов, а расы дворфов, гномов и орков впервые появились в игре рядом с
привычной расой людей.  Роли Монаха и Следопыта присоединились к
Археологам, Варварам, Пещерникам, Целителям, Рыцарям, Жрецам, Плутам,
Самураям, Туристам, Валькириям и, конечно же, Волшебникам.  Это также
была первая версия, позволившая ездить верхом на скакуне, и первая
версия с публично доступным веб-сайтом, перечислявшим все обнаруженные
ошибки.  Несмотря на постоянно растущий список ошибок, 3.3 оказалась
достаточно стабильной, чтобы просуществовать более полутора лет.

Команда разработчиков NetHack 3.4 изначально состояла из Майкла
Эллисона, Кена Арромди, Дэвида Корса, Джесси Колле, Кевина Хьюго, Кена
Лорбера, Дина Люика, Пэта Рэнкина, Майка Стивенсона, Джанет Валз и Пола
Виннера, а Уорик Эллисон присоединился незадолго до выпуска NetHack
3.4.0 в марте 2002 года.

Как и с версией 3.3, разные люди вносили вклад в игру в целом, а также
поддерживали порты на различных платформах, на которых работает NetHack:

Пэт Рэнкин поддерживал 3.4 для VMS.

Майкл Эллисон поддерживал NetHack 3.4 для платформы MS-DOS.
Пол Виннер и Йицхак Сапир оказывали поддержку.

Дин Люик, Марк Модролл и Кевин Хьюго поддерживали и улучшали порт
3.4 для Macintosh.

Майкл Эллисон, Дэвид Корс, Алекс Компел, Дион Николаас и Йицхак Сапир
поддерживали и улучшали 3.4 для платформы Microsoft Windows.  Алекс Компел
внёс новый графический интерфейс для порта Windows.  Алекс Компел также
внёс порт Windows CE для 3.4.1.

Рон Ван Иварден был единственным сопровождающим NetHack для OS/2 в
течение нескольких последних выпусков.  К сожалению, последняя машина
Рона с OS/2 перестала работать в начале 2006 года.  Огромное спасибо
Рону за то, что он все эти годы поддерживал NetHack на OS/2.

Янне Салмиярви и Теему Суикки поддерживали и улучшали порт Amiga для
3.4 после того, как Янне Салмиярви возродил его для 3.3.1.

Кристиан «Марвин» Бресслер поддерживал 3.4 для Atari после того, как
возродил её для 3.3.1.

Выпуск NetHack 3.4.3 в декабре 2003 года ознаменовал начало долгого
перерыва в выпусках.  3.4.3 оказалась замечательно стабильной версией,
доставлявшей сообществу удовольствие более десяти лет.  Команда
разработчиков NetHack медленно и тихо продолжала работать над игрой за
кулисами в течение правления 3.4.3.  Именно в тот же период в сообществе
NetHack появилось несколько новых вариантов.  В частности, sporkhack от
Дерека С. Рэя, unnethack от Патрика Мюллера, nitrohack и его
наследники, первоначально от Дэниела Талера, а затем от Алекса Смита,
и Dynahack от Тунга Нгуена.  Некоторые из этих вариантов продолжают
разрабатываться, поддерживаться и радовать сообщество по сей день.

В сентябре 2014 года промежуточный снимок разрабатываемого кода был
публично выпущен другими сторонами.  Поскольку этот код был работой в
процессе и не прошёл процесс отладки, подходящий для выпуска, было
решено, что номера версий, присутствующие на этом снимке кода, будут
изъяты и никогда не будут использованы в официальном выпуске NetHack.
На официальном веб-сайте команды разработчиков NetHack nethack.org было
размещено объявление об этом с заявлением, что никогда не будет
официальных выпускных версий 3.4.4, 3.5 или 3.5.0.

В январе 2015 года началась подготовка к выпуску NetHack 3.6.

В начале разработки того, что в итоге было выпущено как 3.6.0, команда
разработчиков NetHack состояла из Уорика Эллисона, Майкла Эллисона, Кена
Арромди, Дэвида Корса, Джесси Колле, Кена Лорбера, Дина Люика, Пэта
Рэнкина, Майка Стивенсона, Джанет Валз и Пола Виннера.  В начале 2015
года, перед выпуском 3.6.0, к команде разработчиков NetHack
присоединились новые участники Шон Хант, Паси Каллинен и Дерек С. Рэй.

Ближе к концу разработки 3.6.0 ушёл из жизни один из значимых
вдохновителей многих юмористических и весёлых возможностей игры — автор
Терри Пратчетт.  NetHack 3.6.0 ввёл дань уважения ему.

3.6.0 был выпущен в декабре 2015 года и объединил работу, проделанную
командой разработчиков с момента выпуска 3.4.3, с некоторыми любимыми
патчами сообщества.  Было исправлено много ошибок, и часть кода была
переструктурирована.

Команда разработчиков NetHack, а также Стив ВанДевендер и Кевин
Смолковски обеспечили продолжение работы NetHack 3.6 на различных
разновидностях UNIX и поддерживали интерфейс X11.

Кен Лорбер, Хаоян Ван, Пэт Рэнкин и Дин Люик поддерживали порт NetHack
3.6 для MacOS.

Майкл Эллисон, Дэвид Корс, Барт Хаус, Паси Каллинен, Алекс Компел,
Дион Николаас, Дерек С. Рэй и Йицхак Сапир поддерживали порт NetHack
3.6 для Microsoft Windows.

Пэт Рэнкин пытался поддерживать порт VMS для NetHack 3.6, чему мешал
ограниченный доступ.  Кевин Смолковски обновил и протестировал его для
самой последней версии OpenVMS (V8.4 на момент написания) на Alpha и
Integrity (также известной как Itanium, она же IA64), но не на VAX.

Рэй Чейсон возродил порт MS-DOS для 3.6 и внёс необходимые обновления
для широкого сообщества.

В конце апреля 2018 года несколько сотен исправлений ошибок для 3.6.0 и
некоторые новые возможности были собраны и выпущены как NetHack 3.6.1.
Команда разработчиков NetHack на момент выпуска 3.6.1 состояла из Уорика
Эллисона, Майкла Эллисона, Кена Арромди, Дэвида Корса, Джесси Колле,
Паси Каллинена, Кена Лорбера, Дина Люика, Патрика Мюллера, Пэта
Рэнкина, Дерека С. Рэя, Алекса Смита, Майка Стивенсона, Джанет Валз
и Пола Виннера.

В начале мая 2019 года ещё 320 исправлений ошибок вместе с некоторыми
улучшениями и принятым оконным портом curses были выпущены как 3.6.2.

Барт Хаус, который десятилетиями вносил вклад в игру как участник команды
портирования, присоединился к команде разработчиков NetHack в конце мая
2019 года.

NetHack 3.6.3 был выпущен 5 декабря 2019 года и содержал более 190
исправлений ошибок для NetHack 3.6.2.

NetHack 3.6.4 был выпущен 18 декабря 2019 года и содержал исправление
безопасности и несколько исправлений ошибок.

NetHack 3.6.5 был выпущен 27 января 2020 года и содержал несколько
исправлений безопасности и небольшое число исправлений ошибок.

NetHack 3.6.6 был выпущен 8 марта 2020 года и содержал исправление
безопасности и несколько исправлений ошибок.

NetHack 3.6.7 был выпущен 16 февраля 2023 года и содержал исправление
безопасности и несколько исправлений ошибок.

Работа над разработкой крупного выпуска, следующего за NetHack 3.6,
началась в 2015 году примерно в то же время, когда выпускался NetHack
3.6.0.  Эта работа продолжалась параллельно с каждым из выпусков NetHack
3.6 с 2015 по 2023 год и продолжалась до конца апреля 2026 года.  Впервые
эта разработка публично разделялась на GitHub и SourceForge по мере её
прохождения.  Она велась под ярлыком «работа в процессе» (WIP) NetHack-3.7,
хотя номер версии следующего выпуска ещё не был окончательно определён.

Открытие разработки для публики принесло много хорошего и некоторые
трудности.  Люди могли наблюдать и критиковать изменения и новые
возможности почти немедленно, и часто делали это.  Система pull request
на GitHub позволяла людям напрямую вносить вклад в разработку.  Вклад
помог решить очень многие ошибки в игре, и мы благодарим всех
вкладчиков.

В начале 2026 года, когда разработка игры стала достаточно стабильной,
чтобы рассматривать начало официального выпуска, команда разработчиков
просмотрела характер и количество изменений в игре.  Было ясно, что
глубины и широты достаточно для крупного выпуска, и была выбрана версия
5.0.  Это новый крупный выпуск после 3.x, без какой-либо неоднозначности
или путаницы с существующими вариантами, которые могли бы возникнуть,
если бы она была выпущена как версия 4.0.

NetHack 5.0.0 был выпущен 2 мая 2026 года.

Исходный код NetHack 5.0.0 был изменён и модернизирован для соответствия
стандарту C99.  Выпуск 5.0.0 содержал более 3100 исправлений, изменений
и обновлённых возможностей.

NetHack 5.0 был первой версией, заменившей компиляторы уровней и
подземелий на lex и yacc из прошлых версий новым подходом на основе
интерпретатора Lua для предоставления этих элементов.  Lua также
используется для текстов квестов в NetHack 5.0.0.  Вся команда
разработчиков признаёт работу, проделанную Паси Каллиненом, чтобы это
стало возможным.

На момент выпуска NetHack 5.0 в основную команду разработчиков, активную
и бывшую, входили Уорик Эллисон, Майкл Эллисон, Кен Арромди, Дэвид Корс,
Джесси Колле, Барт Хаус, Кевин Хьюго, Паси Каллинен, Кен Лорбер, Дин
Люик, Пэт Рэнкин, Дерек С. Рэй, Алекс Смит, Патрик Мюллер, Майк
Стивенсон, Джанет Валз, Пол Виннер.

Кен Лорбер, Пэт Рэнкин, Патрик Мюллер и Майкл Эллисон помогли
обеспечить работу NetHack 5.0 на macOS.

Инго Пашке каким-то образом сумел возродить порт NetHack 5.0 для Amiga,
используя для этого кросс-компилятор на современной платформе.  Его
работа была передана, чтобы другие могли без труда создать NetHack 5.0
для Amiga благодаря его усилиям.

Рэй Чейсон внёс большую часть работы по сопровождению порта NetHack 5.0
для MS-DOS, включая перенос интерфейса curses на него.
Майкл Эллисон обеспечил, чтобы основные изменения NetHack 5.0 продолжали
работать с портом msdos и поддерживали его живым.  Кросс-компиляция
порта MS-DOS помогла сделать это возможным и в основном безболезненным.

Люди, внесшие вклад в порт NetHack 5.0 для Windows с момента начала
разработки NetHack 5.0 более одиннадцати лет назад, включали Майкла
Эллисона, Дэвида Корса, Барта Хауса, Паси Каллинена, Алекса Компела,
Диона Николааса, Дерека С. Рэя и Йицхака Сапира.

С грустью команда разработчиков хотела бы отметить и вспомнить прошлые
заслуги покойного Рона Ван Ивардена, который был единственным
сопровождающим NetHack для OS/2 в течение нескольких прошлых выпусков
NetHack.  Рона будет не хватать.

Официальный веб-сайт NetHack поддерживается Кеном Лорбером по адресу
https://www.nethack.org/.

От имени сообщества NetHack ещё раз большое спасибо М. Дрю Стрейбу и
Паси Каллинену за предоставление публичного сервера NetHack на
nethack.alt.org.  Спасибо Киту Симпсону и Энди Томсону за hardfought.org.
Спасибо всем безымянным искателям приключений, вкладывающим своё время
и силы в ежегодные турниры NetHack, такие как Junethack, Ноябрьский
турнир NetHack, а в прошлые дни — devnull.net (сейчас недоступен, но не
забыт).

                           - - - - - - - - - -

Время от времени какой-нибудь развращённый индивидуум в сети отправляет
особенно интригующую модификацию в помощь игре.  Команда разработчиков
NetHack иногда отмечает имена худших из этих злоумышленников здесь, в
этом списке искателей приключений:

    Adam Aronow               Irina Rempt-Drijfhout     Mike Gallop
    Alex Kompel               Izchak Miller             Mike Passaretti
    Alex Smith                J. Ali Harlow             Mike Stephenson
    Andreas Dorn              Janet Walz                Mikko Juola
    Andy Church               Janne Salmijarvi          Nathan Eady
    Andy Swanson              Jean-Christophe Collet    Norm Meluch
    Andy Thomson              Jeff Bailey               Olaf Seibert
    Ari Huttunen              Jochen Erwied             Pasi Kallinen
    Bart House                John Kallen               Pat Rankin
    Benson I. Margulies       John Rupley               Patric Mueller
    Bill Dyer                 John S. Bien              Paul Winner
    Boudewijn Waijers         Johnny Lee                Pierre Martineau
    Bruce Cox                 Jon W{tte                 Ralf Brown
    Bruce Holloway            Jonathan Handler          Ray Chason
    Bruce Mewborne            Joshua Delahunty          Richard Addison
    Cameron Root              Karl Garrison             Richard Beigel
    Carl Schelin              Keizo Yamamoto            Richard P. Hughey
    Chris Russo               Keith Simpson             Rob Menke
    David Cohrs               Ken Arnold                Robin Bandy
    David Damerell            Ken Arromdee              Robin Johnson
    David Gentzel             Ken Lorber                Roderick Schertler
    David Hairston            Ken Washikita             Roland McGrath
    Dean Luick                Kestrel Gregorich-Trevor  Ron Van Iwaarden
    Del Lamb                  Kevin Darcy               Ronnen Miller
    Derek S. Ray              Kevin Hugo                Ross Brown
    Deron Meranda             Kevin Sitze               Sascha Wostmann
    Dion Nicolaas             Kevin Smolkowski          Scott Bigham
    Dylan O'Donnell           Kevin Sweet               Scott R. Turner
    Eric Backus               Lars Huttar               Sean Hunt
    Eric Hendrickson          Leon Arnott               Stephen Spackman
    Eric R. Smith             M. Drew Streib            Stefan Thielscher
    Eric S. Raymond           Malcolm Ryan              Stephen White
    Erik Andersen             Mark Gooderum             Steve Creps
    Fredrik Ljungdahl         Mark Modrall              Steve Linhart
    Frederick Roeber          Marvin Bressler           Steve VanDevender
    G. Branden Robinson       Matthew Day               Teemu Suikki
    Gil Neiger                Merlyn LeRoy              Tim Lennan
    Greg Laskin               Michael Allison           Timo Hakulinen
    Greg Olson                Michael Feir              Tom Almy
    Gregg Wonderly            Michael Hamel             Tom West
    Hao-yang Wang             Michael Meyer             Warren Cheung
    Helge Hafting             Michael Sokolov           Warwick Allison
    Ingo Paschke              Mike Engber               Yitzhak Sapir
