Логические опции без особых флагов компиляции (значения по умолчанию в []):
(Вы можете узнать, какие опции существуют в вашей версии, проверив текущую
настройку опций, которая доступна по команде 'O'.)

acoustics      может ли ваш персонаж что-нибудь слышать              [Да]
armorstatus    показывать дополнительное поле статуса со сводкой надетой
               брони                                            [Нет]
autodescribe   описывать местность под курсором                     [Нет]
autodig        копать, если двигаетесь и держите в руках копающий
               инструмент                                          [Нет]
autoopen       при попытке войти в дверь пытаться открыть её         [Да]
autopickup     автоматически подбирать предметы, через которые вы
               переходите                                         [Да]
autoquiver     при стрельбе из пустого колчана выбрать какой-нибудь [Нет]
               подходящий предмет из инвентаря, чтобы заполнить колчан
BIOS           разрешить использование вызовов IBM ROM BIOS          [Нет]
blind          ваш персонаж постоянно слеп                        [Нет]
bones          разрешить загрузку файлов костей (bones)           [Да]
clicklook      смотреть на карту по щелчку правой кнопки мыши    [Нет]
cmdassist      давать подсказки при ошибках в направлениях и других
               командах                                           [Да]
color          использовать разные цвета для предметов на экране
               [Да для микроЭВМ]
confirm        спрашивать перед атакой на ручных или мирных монстров [Да]
dark_room      показывать невидимый пол другим цветом               [Да]
dropped_nopick исключить брошенные предметы из автоподбора         [Да]
eight_bit_tty  отправлять 8-битные символы прямо на терминал      [Нет]
extmenu        tty, curses: использовать меню для # (расширенных команд)
                                                                  [Нет]
               X11: меню содержит все команды (T) либо традиционный набор (F)
female         устарело; используйте составную опцию gender:female [Нет]
fixinv         стараться сохранять ту же букву для того же предмета [Да]
force_invmenu  команды, запрашивающие предмет из инвентаря, показывают
               меню                                               [Нет]
goldX          при фильтрации предметов по состоянию благословения/проклятия
                                                                  [Нет]
               классифицировать ли золото как X (неизвестное) или U
               (несблагословлённое)
help           выводить всю доступную информацию при использовании команды /
                                                                  [Да]
herecmd_menu   показывать меню некоторых возможных команд при щелчке
               по себе или рядом с собой мышью                    [Нет]
hilite_pet     отображать питомцев выделенным образом              [Нет]
hilite_pile    отображать кучи предметов выделенным образом       [Нет]
ignintr        игнорировать сигнал прерывания, включая разрывы    [Нет]
implicit_uncursed  опускать «несблагословлён» в инвентаре, если возможно
                                                                  [Да]
legacy         печатать вступительное сообщение                   [Да]
lit_corridor   показывать тёмный коридор освещённым, если он в поле зрения
                                                                  [Нет]
lootabc        использовать a/b/c вместо o/i/b при обыске           [Нет]
mail           включить почтового демона                            [Да]
mention_decor  давать отклик при переходе через лестницы, алтари, [Нет]
               фонтаны и подобное, даже когда это не скрыто предметами
mention_walls  давать отклик при движении вдоль стены             [Нет]
menu_overlay   накладывать меню на экран и выравнивать вправо     [Да]
menucolors     включить сопоставление шаблонов MENUCOLOR для выделения [Нет]
               строк в меню предметов, например в инвентаре; может выделять
               жирным, инверсией и т.п., даже когда цвет недоступен или
               выключен
nudist         начать игру без брони                              [Нет]
null           разрешить отправку нулей на ваш терминал            [Да]
               попробуйте выключить эту опцию (заставив NetHack использовать
               собственный код задержки), если перемещаемые предметы словно
               телепортируются через комнаты
pauper         начать игру без имущества                          [Нет]
perm_invent    держать инвентарь в постоянном окне               [Нет]
pickup_stolen  переопределять pickup_types для украденных предметов [Да]
pickup_thrown  переопределять pickup_types для брошенных предметов [Да]
price_quotes   показывать запомненные ценники для неопознанных предметов
                                                                  [Нет]
pushweapon     при взятии нового оружия помещать ранее взятое оружие [Нет]
               в слот вторичного оружия
quick_farsight обычно пропускать возможность просмотра карты, когда [Нет]
               происходит случайное ясновидение
rawio          разрешить использование низкоуровневого ввода-вывода [Нет]
reroll         разрешить перегенерацию стартового инвентаря     [Нет]
rest_on_space  считать клавишу пробела клавишей отдыха            [Нет]
safe_pet       не давать вам (сознательно) атаковать ваших питомцев [Да]
safe_wait      требовать использования префикса 'm' перед '.' или 's',
               чтобы ждать или искать рядом с враждебным монстром [Да]
sanity_check   выполнять проверки целостности данных               [Нет]
showexp        показывать ваши накопленные очки опыта            [Нет]
showrace       показывать себя по расе, а не по роли             [Нет]
showvers       показывать номер версии в строках статуса         [Нет]
silent         не использовать звуковой сигнал вашего терминала  [Да]
sortpack       группировать похожие типы предметов в инвентаре   [Да]
sparkle        показывать искрящийся эффект при отражении магических [Да]
               атак (например, огненной атаки по огнеупорному монстру)
standout       использовать особый режим для --More-- в сообщениях [Нет]
status_updates обновлять строки статуса                             [Да]
terrainstatus  показывать дополнительное поле статуса с описанием текущего
               местоположения                                     [Нет]
time           показывать прошедшее игровое время в ходах        [Нет]
tips           показывать полезные подсказки во время игры        [Да]
tombstone      печатать надгробную плиту, когда вы умираете      [Да]
toptenwin      печатать таблицу лучших в окне, а не в stdout     [Нет]
travel         включает путешествие по щелчку мыши, если поддерживается; [Да]
               можно выключить, чтобы щелчки по карте не пытались двигать
               героя; не влияет на путешествие через '_'
use_darkgray   использовать жирный чёрный вместо синего для чёрных глифов.
                                                                  [Да]
use_inverse    отображать обнаруженных монстров выделенным образом [Нет]
verbose        печатать больше комментариев во время игры         [Да]
weaponstatus   показывать дополнительное поле статуса с перечнем
               удерживаемого оружия                              [Нет]
whatis_menu    показывать меню при получении позиции на карте    [Нет]
whatis_moveskip пропускать одинаковые глифы при получении позиции на карте
                                                                  [Нет]


Существуют дальнейшие логические опции, управляемые флагами компиляции.

Логическая опция, если при компиляции был задан INSURANCE:
checkpoint     сохранять состояние игры после каждой смены уровня, для [Да]
               возможного восстановления после сбоя программы

Логическая опция, если при компиляции был задан NEWS:
news           печатать любые новости от администратора игры при запуске [Да]

Логическая опция, если при компиляции был задан SCORE_ON_BOTL:
showscore      показывать ваш приблизительный накопленный счёт [Нет]

Логическая опция, если при компиляции был задан TIMED_DELAY (только tty
или curses):
timed_delay    в unix и VMS использовать таймер вместо отправки [Да]
               лишнего вывода на экран при попытке сделать паузу для
               эффекта отображения.  в MSDOS без библиотеки termcap —
               делать ли паузу для визуального эффекта.

Логическая опция, если при компиляции был задан ALTMETA:
altmeta        для unix и VMS трактовать двухсимвольную последовательность
               "ESC c" как M-c (Meta+c, установлен 8-й бит), когда nethack [Нет]
               получает команду с клавиатуры игрока.

Логическая опция, если при компиляции был задан TILES_IN_GLYPHMAP (MSDOS):
preload_tiles  управлять тем, загружаются ли тайлы в оперативную память [Да]
               в начале игры.  Это повышает производительность тайловой
               графики, но требует больше памяти.

Логическая опция, если при компиляции был задан TTY_TILES_ESCCODES
(только tty):
vt_tiledata    вставлять маркеры дополнительных данных escape-кодов в вывод
                                                                  [Нет]

Логическая опция, если при компиляции был задан TTY_SOUND_ESCCODES
(только tty):
vt_sounddata   вставлять маркеры звуковых данных escape-кодов в вывод [Нет]

Логические опции, которые могут быть доступны в зависимости от того, какие
интерфейсы поддерживает программа.  Если она поддерживает несколько таких,
некоторые из них могут показываться как доступные для установки, но ничего
не делать, если вы используете другой интерфейс, нежели тот, для которого
они предназначены:
ascii_map      показывать карту текстом, принудительно выключает tiles_map;
               Qt, X11
guicolor       curses
hitpointbar    curses, tty, Windows GUI, если включено statushilites;
               Qt без statushilites; X11, если 'fancy_status' выключен
               (через X application defaults) и statushilites включены
popup_dialog   curses, Qt, Windows GUI
selectsaved    tty (Qt и Windows GUI делают это безусловно)
splash_screen  curses, Qt, Windows GUI
tiled_map      показывать карту тайлами, принудительно выключает ascii_map;
               Qt, X11

Логические опции, доступные в режиме отладки (также известном как режим
волшебника):
menu_tab_sep   форматирование меню — не трогать
monpolycontrol  позволить игроку выбирать новые формы монстров, меняющих
               форму
montelecontrol  позволить игроку выбирать место назначения телепортированных
               монстров
travel_debug   показывать на карте состояние алгоритма поиска пути
wizweight      включать вес предметов в отображение инвентаря

Любую логическую опцию можно установить в True, включив её среди
устанавливаемых опций, или инвертировать (установить в False), поставив
перед её именем '!' или 'no'.  В качестве альтернативы можно использовать
составной синтаксис: 'optname:true' и 'optname:false'.

 - - - - -

Составные опции записываются как имя_опции:значение.

Составные опции, которые можно установить во время игры:

autounlock    при попытке открыть запертую дверь или обыскать [Apply-Key]
               запертый контейнер указывает действие: может быть
               None или одно или несколько из Untrap + Apply-Key + Kick +
               Force;  если включено Untrap, оно будет выполнено первым;
               остальные применяются, если вы отвечаете «нет» на вопрос
               «проверить ловушки?»;  при ответе «да» оно может ничего не
               найти, даже если ловушка присутствует, и израсходует остаток
               текущего хода независимо от того, найдёт ли что-нибудь;
               Kick полезно только для дверей, а Force — только для
               контейнеров;  любое из них будет предпринято только если
               Untrap опущено или пропущено, а Apply-Key опущено, или вы не
               несёте инструмент для отпирания, или отказываетесь его
               использовать
boulder       переопределить символ валуна по умолчанию          [`]
crash_email   адрес электронной почты для заполнения отчётов о сбоях []
crash_name    имя для заполнения отчётов о сбоях                  []
crash_urlmax  длина самого длинного URL, который можно сгенерировать для
               отчёта о сбое                                       []
disclose      типы информации, которую вы хотите получать [ni na nv ng nc no]
               в конце игры
               (разделённый пробелами список двухсимвольных значений;
               префикс: '+' всегда раскрывать, '-' никогда не раскрывать,
               'n' запрашивать со значением по умолчанию «нет», 'y'
               запрашивать со значением по умолчанию «да»,
               'a' запрашивать выбор порядка сортировки (только для суффикса
               'v');
               суффикс: 'i' инвентарь, 'a' характеристики, 'v' поверженные
               монстры, 'g' истреблённые и вымершие монстры, 'c' поведение
               и достижения, 'o' обзор подземелья)
fruit         название фрукта, который вам нравится есть        [slime mold]
               (в основном прихоть, которую NetHack использует время от времени)
hilite_status задаёт правило выделения поля статуса                []
               (допускается несколько экземпляров)
menustyle     пользовательский интерфейс для выбора нескольких предметов:
                                                                  [Full]
               Traditional — запросить классы интереса, затем запрашивать
                              предмет за предметом для этих классов;
               Combination — запросить классы интереса, затем использовать
                              меню для выбора предметов;
               Full        — меню для классов интереса, затем меню предметов;
               Partial     — пропустить фильтрацию по классам, использовать
                              меню всех предметов;
               важна только первая буква ('T','C','F','P')
               (При Traditional многие действия позволяют псевдоклассу 'm'
               запросить меню для выбора предметов: разовая Combination.)
menu_objsyms  включать ли символы классов предметов в меню:       [4]
               0 - никакие    — не добавлять символы предметов в меню;
               1 - заголовки — добавлять символ класса предметов к строкам
                                заголовков меню;
               2 - записи     — показывать глифы предметов (те же, что и
                                символы классов для ASCII-интерфейсов) в
                                каждой строке записи меню;
               3 - оба        — 1 и 2 вместе;
               4 - условно    — как 2, но только если нет заголовков;
               5 - одно-или-другое — 1 и 4 вместе;
               варианты 0 и 1 должны работать с любым интерфейсом; 2–5
               поддерживаются tty и curses
msg_window    поведение вызова сообщений ^P для интерфейса tty:  [s]
               single      — одно сообщение за раз
               full        — полное окно со всеми сохранёнными верхними
                            строками сообщений
               reverse     — полное, с сообщениями от более новых к более
                            ранним
               combination — первые два подряд идущих ^P показывают
                            одиночные сообщения, третье даёт полный набор
msg_window    поведение вызова сообщений ^P для интерфейса curses: [r]
               reverse     — полное окно, сначала самые новые
               full        — полное, с сообщениями от более ранних к более
                            новым, изначально позиционируется на последней
                            странице, чтобы начиная с самых новых сообщений
                            они были в поле зрения
number_pad    буквенное или цифровое управление движением:          [0]
                0 — традиционное движение hjkl + yubn (по умолчанию);
                1 — движением управляют цифры, для использования с цифровой
                    клавиатурой;
                2 — то же, что 1, но '5' работает как префикс 'g', а не 'G';
                3 — цифры для телефонной клавиатуры (1,2,3 сверху,
                    7,8,9 снизу);
                4 — телефонная клавиатура (3) в сочетании с предпочтением
                    '5' (2);
               -1 — "qwertz"; буквенное движение, но 'z' меняется местами
                    с 'y'.
               Установка number_pad (в положительное значение) влияет на
               обработку всех цифровых клавиш, а не только на цифровой
               клавиатуре.
packorder     список символов по умолчанию для видов предметов [")[%?+!=/(*`0_]
               задающий порядок, в котором ваш инвентарь (и некоторые другие
               вещи) показывается, если включена опция 'sortpack'
               (Если вы укажете только некоторые виды предметов, остальные
               из порядка по умолчанию будут добавлены в конец.)
paranoid_confirmation  разделённый пробелами список [paranoid_confirm:pray swim]
               ситуаций, где желате другой запрос подтверждения
               Confirm — при запросе «да» также требовать «нет» для отказа;
                       также требует «да» вместо y для pray, trap, Autoall
               quit    — «да» вместо y для подтверждения выхода или входа
                       в режим исследования
               die     — «да» вместо y для подтверждения смерти (для режима
                       исследования или отладки)
               bones   — «да» вместо y для подтверждения сохранения данных
                       костей в режиме отладки
               attack  — «да» вместо y для подтверждения атаки на мирного
                       монстра
               wand-break  — «да» вместо y для подтверждения ломания
                       волшебной палочки
               eating  — «да» вместо y для подтверждения продолжения еды
               Were-change — «да» вместо y для подтверждения смены формы
                       из-за ликантропии, когда герой имеет контроль над
                       полиморфизмом;
               pray    — y для подтверждения попытки молитвы; включено по
                       умолчанию
               trap    — y для входа в известную ловушку, если она не
                       безвредна;
               swim    — требовать префикс m для входа в воду или лаву,
                       когда герой их видел и не имеет нарушений; включено
                       по умолчанию;
               AutoAll — y для подтверждения, если используется menustyle:Full
                       и в меню фильтрации классов предметов выбран выбор 'A';
               Remove  — всегда выбирать из инвентаря для 'R' и 'T', даже
                       когда надет только один подходящий предмет для снятия
perminv_mode  если интерфейс поддерживает постоянное окно инвентаря [a]
               и опция perm_invent истинна, это управляет тем, что будет
               показано:
               none/off — вести себя так, будто perm_invent ложна
               all/on   — показать инвентарь, кроме золота (по умолчанию)
               full     — показать инвентарь, включая золото
               in-use   — показывать только надетые и удерживаемые предметы
               (необязательная поддержка perm_invent в интерфейсе tty
               включает пару дополнительных вариантов, варьирующих all и full)
pickup_burden когда вы подбираете предмет, превышающий этот уровень
               обременённости [S]
               (Unencumbered, Burdened, streSsed, straiNed, overTaxed,
               или overLoaded), вас спросят, хотите ли вы продолжить.
pickup_types  список символов по умолчанию для видов предметов, которые []
               автоподбирать, когда эта опция включена; пустой список
               означает «все»
pile_limit    для отклика при переходе через предметы на полу:  [5]
               порог, при котором вместо перечисления показывается «здесь
               есть предметы».  (0 означает «всегда перечислять предметы».)
runmode       управляет тем, как часто обновляется окно карты при [run]
               многошаговом движении (различные режимы бега или команда
               travel):
               teleport — не обновлять карту, пока движение не остановится;
               run      — периодически обновлять карту (интервал — семь
                        шагов);
               walk     — обновлять карту после каждого шага;
               crawl    — как walk, но с задержкой после каждого шага.
               (Это влияет только на отображение на экране, а не на
               фактическое движение.)
scores        части списка очков, которые вы хотите видеть, когда [own/3 top/2 around]
               заканчивается игра.  Вы выбираете комбинацию из лучших
               результатов, результатов, соседних с лучшими, и всех ваших
               собственных результатов.
sortdiscoveries предпочтительный порядок при просмотре списка открытых
               предметов [o]
               o — в порядке открытия внутри каждого класса
               s — порядок «loot» из sortloot
               c — по алфавиту внутри каждого класса
               a — по алфавиту по всем классам
sortloot      предпочтительный порядок при осмотре набора предметов   [n]
               none — без сортировки
               loot — сортировать кучи предметов на полу и в контейнерах
               full — 'loot' плюс предметы в инвентаре
sortvanquished предпочтительный порядок при просмотре списка поверженных
               монстров [t]
               t — традиционный, по уровню монстра
               d — по рейтингу сложности монстра
               a — по алфавиту, сначала уникальные монстры, затем остальные
               c — по классу, от низкого уровня к высокому внутри каждого
                    класса
               n — по количеству, от высокого к низкому
               z — по количеству, от низкого к высокому
statushilites показывать ли выделения статуса (при ненулевом значении) и [0]
               также сколько ходов показывать временные выделения (для
               правил hilite_status 'up', 'down' и 'changed')
statuslines   использовать ли расширенный (3) или сжатый (2) статус [2]
               (для tty и curses; 2 традиционный, 3 рекомендуется;
               также для Qt, где 3 традиционен, а 2 рекомендуется)
suppress_alert отключать различные предупреждения о изменениях в игре или
               пользовательском интерфейсе, например уведомление для
               команды 'Q' о том, что выход теперь выполняется через #quit
               (например, используйте suppress_alert:3.3.1, чтобы
               остановить это и любые другие уведомления, добавленные в
               этой версии или ранее)
versinfo      выбирает, какая информация показывается, когда showvers [1 or 4]
               истинно (умолчание зависит от статуса разработки программы)
whatis_coord  управляет тем, включать ли координаты карты, когда [n]
               активен autodescribe для команд '/' и ';'.
               Значение — первая буква одного из
               compass      — (относительно вас; 'east' или '3s' или
                            '2n,4w')
               full compass — ('east' или '3south' или '2north,4west')
               map          — <x,y>        (столбец карты x=0 не используется)
               screen       — [строка,столбец] (строка смещена для
                            соответствия использованию tty)
               none         — координаты не показываются.
whatis_filter управляет тем, как фильтровать подходящие координаты карты,
               когда получается позиция на карте, например для команды
               travel. [n]
               Значение — одно из
               n - без фильтрации
               v - только позиции в поле зрения
               a - позиции в той же области (комнате, коридоре и т.п.)

Составные опции, которые можно устанавливать только при запуске:

align      Ваше стартовое мировоззрение (законный, нейтральный, [random]
           хаотичный или случайный).  Многие роли ограничивают выбор
           подмножеством.  Можно указать только первую букву.
catname    имя вашего стартового питомца, если это котёнок       [none]
dogname    имя вашего стартового питомца, если это маленькая собака [none]
           У некоторых ролей, начинающих с собакой, имя предустановлено
           (например, «Hachi» для Самурая), но оно будет переопределено,
           если вы укажете dogname.
gender     Ваш стартовый пол (мужской, женский или случайный).   [random]
           Можно указать только первую букву.  Хотя вы всё ещё можете
           обозначить пол старыми логическими опциями "male" и "female",
           опция "gender" будет иметь приоритет.
horsename  имя вашего стартового питомца, если это пони           [none]
menu_*     задать односимвольные ускорители для команд меню.
           Вот список всех команд с их клавишей по умолчанию, за которым
           следует список оконных портов, реализующих их:
           (t — tty, c — curses, w — Windows GUI, x — X11, q — Qt)
           menu_first_page    перейти к первой странице меню    [^](tcwxq)
           menu_last_page     перейти к последней странице меню [|](tcwxq)
           menu_next_page     перейти к следующей странице меню [>](tcwxq)
           menu_previous_page вернуться к предыдущей странице меню
                                                                [<](tcwxq)
           menu_shift_left    сдвинуть вид влево (только perm_invent)
                                                                [{](cx)
           menu_shift_right   сдвинуть вид вправо (только perm_invent)
                                                                [}](cx)
           menu_select_all    выбрать все предметы в меню       [.](tcwxq)
           menu_select_page   выбрать все предметы на этой странице меню
                                                                [,](tcwq)
           menu_deselect_all  снять выбор со всех предметов в меню
                                                                [-](tcwxq)
           menu_deselect_page снять выбор со всех предметов на этой странице
                                                                [\](tcwq)
           menu_invert_all    инвертировать все предметы в меню [@](tcwxq)
           menu_invert_page   инвертировать все предметы на этой странице
                                                                [~](tcwq)
           menu_search        запросить целевой текст и инвертировать
                              предметы, которые ему соответствуют  [:](tcwxq)
msghistory количество сохраняемых верхних строк сообщений             [20]
name       имя вашего персонажа   [умолчание — имя пользователя в
           многопользовательских системах, запрос «кто вы?» в
           однопользовательских системах или если имя пользователя отнесено
           к общим, как "games"]
           MS Windows считается однопользовательской системой, хотя и
           поддерживает имена пользователей.  Если имя персонажа указано в
           командной строке (обычно через 'nethack -u myname' в зависимости
           от типа системы и способа доступа к ней), это имя переопределяет
           'name' из ваших опций.
pettype    предпочтительный тип вашего питомца (кошка, собака, пони,
           случайный или никакой), если ваша роль допускает более одного
           типа (или если вы хотите избежать стартового питомца).  Большинство
           ролей допускают собаку или кошку, но не пони.  Для ролей,
           которые принудительно задают конкретный тип, pettype
           игнорируется, если только не указано 'none'.
playmode   обычная игра, нерейтинговый режим исследования или режим
           отладки [normal]
race       Ваша стартовая раса (например, race:Human, race:Elf).  [random]
           Большинство ролей ограничивают выбор расы подмножеством.
role       Ваша стартовая роль (например, role:Barbarian, role:Valk). [random]
           Хотя вы можете указать только первую букву(ы), будет выбрана
           только первая найденная подходящая роль; поэтому рекомендуется
           указывать как можно большую часть имени роли.  Вы также можете
           обозначить свою роль, добавив её к опции "name" (например,
           name:Vic-V), но опция "role" будет иметь приоритет.
windowtype используемая оконная система    [зависит от операционной системы и
           настроек компиляции]    если доступно более одного варианта.
           Некоторые экземпляры программы поддерживают только один тип окна;
           в этом случае ничего указывать не нужно.  Список поддерживаемых
           типов окон в вашей программе можно увидеть во время работы
           программы, используя команду #version, или извне программы,
           просмотрев текстовый файл 'options', который генерируется при её
           сборке.

Примеры списков опций:
!autopickup,!tombstone,name:Gandalf,scores:own/3 top/2 around
female,nonews,dogname:Rover,rest_on_space,!verbose,menustyle:traditional
