 Как работают динамические настройки:

 Простое меню настроек показывает относительно небольшой набор опций и
 применяет каждое выбранное изменение сразу же, после чего снова открывается,
 чтобы позволить дальнейшие изменения.

 Полное меню настроек показывает текущее значение всех опций и позволяет
 выбрать те из них, которые вы хотели бы изменить.  Однако выбор не вносит
 никаких изменений.  Изменения будут применены после закрытия меню.
 В большинстве интерфейсов NetHack меню закрывается нажатием клавиши
 <enter> или <return>; в других может потребоваться щелчок по [ok].
 Нажатие клавиши <escape> или щелчок по [cancel] закроет меню без
 сохранения ожидающих изменений.

 Меню настроек слишком длинное, чтобы поместиться на одном экране.
 Некоторые интерфейсы разбивают меню на страницы: используйте клавишу
 '>' для перехода к следующей странице и '<' для возврата назад.  Обычно
 на каждой странице повторно используются буквы выбора (a-z).  Другие
 используют одну длинную страницу, и вам нужно пользоваться полосой
 прокрутки; после a-z и A-Z там будут записи без букв выбора.  Их можно
 выбрать щелчком по ним.

 Для переключения логических опций (True/False или On/Off) достаточно
 просто выбрать их.  Для составных опций (которые принимают число, выбор
 одного из нескольких конкретных значений или что-то более сложное и
 перечислены во втором разделе, после логических) у вас запросят новое
 значение.

 В начале каждого из двух разделов приведены значения некоторых
 невыбираемых опций, которые можно задать только до начала игры.  После
 раздела составных опций идут некоторые «прочие» опции, которые принимают
 набор из нескольких значений и обычно более сложны в обращении.

 Некоторые изменения сохранятся только до сохранения (или выхода из)
 текущей игры.  Обычно это касается вещей, которые могут оказаться
 неподходящими, если восстановить сохранённую игру на другом компьютере
 с иными возможностями.  Другие опции будут включены в файл сохранения
 этой игры и сохранят свои значения после восстановления.  Ни одна из
 опций, заданных в меню настроек, не повлияет на другие игры — ни на уже
 сохранённые, ни на новые.  Для этого вам нужно обновить свой файл
 конфигурации времени выполнения и указать желаемые значения опций там.
 Но даже в этом случае при восстановлении существующих игр, содержащих
 сохранённые значения опций, будут использованы именно сохранённые
 значения.
