Краткий справочник режима отладки:

^E  ==  обнаружить секретные двери и ловушки рядом
^F  ==  показать карту уровня; раскрывает ловушки и секретные коридоры,
         но не секретные двери
^G  ==  создать монстра по имени или классу
^I  ==  опознать предметы в рюкзаке
^T  ==  телепортироваться в пределах уровня
^V  ==  телепортироваться между уровнями; '?' выводит меню особых мест
         назначения
^W  ==  загадать желание: предмет, ловушку или ограниченный набор
         ландшафта
^X  ==  показать статус, характеристики и особенности (расширенное
         просветление)

#debugfuzzer    == запустить игру на автопилоте; продолжается до сбоя;
                   повышает предупреждения о невозможном до паники
#levelchange    == задать уровень опыта героя
#lightsources   == показать подвижные источники света
#migratemons    == показать мигрирующих монстров; [Opt] возможно, создать
                   некоторых
#panic          == тест паники (внимание: текущая игра будет завершена)
#polyself       == полиморф себя
#stats          == показать статистику памяти
#terrain        == показать текущий уровень (больше опций, чем в обычной
                   игре)
#timeout        == показать очередь тайм-аутов и временные свойства героя
#vision         == показать массив видимости
#wizborn        == показать статистику рождения/гибели/генофонда/вымирания
                   монстров
#wizcast        == сотворить любое заклинание
#wizdispmacros  == [Opt] проверить внутренние классификации отображения
#wizfliplevel   == транспонировать текущий уровень подземелья
#wizintrinsic   == задать избранным свойствам тайм-ауты
#wizkill        == удалить монстра(ов) из игры
#wizloaddes     == загрузить и выполнить lua-сценарий описания особого
                   уровня
#wizloadlua     == загрузить и выполнить lua-сценарий
#wizmakemap     == пересоздать текущий уровень подземелья
#wizmondiff     == [Opt] проверить расхождения в рейтингах сложности
                   монстров
#wizobjprobs    == [Opt] показать фактические вероятности генерации
                   предметов
#wizrumorcheck  == проверить индексацию слухов; также показать первую,
                   вторую и последнюю случайные надписи, эпитафии и
                   галлюцинаторных монстров
#wizseenv       == показать векторы видимости позиций карты
#wizsmell       == обнюхать монстра
#wiztelekinesis == магически толкнуть монстра
#wizwhere       == показать расположение всех особых уровней в подземелье
#wmode          == показать режимы стен

Опции:
debug_hunger    == отключить голод героя
debug_mongen    == отключить случайную генерацию монстров
debug_overwrite_stairs
                == позволяет заменять лестницы другим ландшафтом
monpolycontrol  == запрашивать новую форму всякий раз, когда монстр меняет
                  форму
sanity_check    == оценивать монстров, предметы и карту перед каждым ходом
wizweight       == дополнять описания предметов их весом

[Opt] = доступно в зависимости от настроек сборки
